views/task/_form.php

SELECT `title`, `id` FROM `task`
---
    <?php $form = ActiveForm::begin(['id'=>'task','class'=>'form-vertical','options' => ['enctype'=>'multipart/form-data']]); ?>


    <?= $form->field($taskChild, 'parent_id')->dropDownList(Task::find()->select(['title','id'])->indexBy('id')->column(),['prompt'=>'Selecionar Terefa, se pretente criar um sub-tarefa']) ?>