controllers/TaskController.php

INSERT INTO `task` (`title`, `description`, `status`, `finish_time`, `created_time`) VALUES ('asdad', 'asdadad', 'work', '2016-11-30', '2016-11-26')
---
    public function actionCreate()
    {
        $model = new Task();
        $taskChild = new TaskChild();

        if ($model->load(Yii::$app->request->post()) && $taskChild->load(Yii::$app->request->post())) {

            $model->created_time = date('Y-m-d');


            if($model->validate() && $taskChild->validate() && $model->save()){

SELECT * FROM `task` WHERE `id`='4'
---
    protected function findModel($id)
    {
        if (($model = Task::findOne($id)) !== null) {